

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы




#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьТекущееВремя(Команда)
	
	ВремяВРаботе = ТекущаяДата();
	ЭтаФорма.Элементы.ДекорВремени.Заголовок = Формат(ВремяВРаботе, "ДФ=""дд ММММ гггг 'г.' ЧЧ:мм:сс""");
	Если ВремяВРаботе < Дата("20220101000000") Тогда
		Лозунг = "До Нового Года еще далеко! Работайте...";
	Иначе
		Лозунг = "С Новым Годом! Веселитесь!..";
	КонецЕсли;
	ЭтаФорма.Элементы.Лозунг.Заголовок = Лозунг;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОбработку(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
